# An√°lise de Dados de Neg√≥cio

## üéØ Objetivos

O objetivo desta an√°lise √© obter as seguintes informa√ß√µes:

1. Evolu√ß√£o do sal√°rio m√©dio ao longo dos anos
2. Quantidade de funcion√°rios ao longo dos anos
3. Total gasto com sal√°rios ao longo dos anos

A base de dados que vamos utilizar vem de um banco de dados SQLite, a qual possui uma √∫nica tabela com os sal√°rios dos funcion√°rios de uma empresa.

## Importa√ß√µes

In [1]:
# Importa a biblioteca pandas com o apelido pd
import pandas as pd

# Importa a biblioteca sqlite3
import sqlite3

## Cria√ß√£o do Dataframe

### Conex√£o com o Banco de Dados

In [2]:
# Cria uma conex√£o com o banco de dados
conexao = sqlite3.connect("salarios.sqlite")

### Cria√ß√£o do Dataframe

In [3]:
# Cria um dataframe a partir da consulta especificada
df_salarios = pd.read_sql("SELECT * FROM Salaries", conexao)

# Exibe as cinco primeiras linhas do dataframe rec√©m-criado
df_salarios.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,567595.43,567595.43,2011,,San Francisco,
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,,538909.28,538909.28,2011,,San Francisco,
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,

In [4]:
# Fecha a conex√£o com o banco de dados
conexao.close()

## Formata√ß√£o

As fun√ß√µes abaixo servem para formatar os valores nas c√©lulas dos dataframes:

In [5]:
def formatar_moeda(valor: float) -> str:
    return "R$ {:_.2f}".format(valor).replace(".", ",").replace("_", ".")

In [6]:
def formatar_valor(valor: float) -> str:
    return "{:_.2f}".format(valor).replace(".", ",").replace("_", ".")

## An√°lise

In [7]:
# Cria um dataframe s√≥ com os dados relativos a San Franciso
df_salarios = df_salarios[df_salarios["Agency"] == "San Francisco"]

In [8]:
df_salarios["Agency"].value_counts()

San Francisco    148654
Name: Agency, dtype: int64

__Evolu√ß√£o dos sal√°rios ao longo dos anos:__

In [9]:
# Cria um dataframe com o valor de salario m√©dio por ano
df_salarios_medios_anuais = df_salarios[["Year", "TotalPay"]].groupby("Year").mean()

# Exibe o dataframe
df_salarios_medios_anuais

          TotalPay
Year
2011  71744.103871
2012  74113.262265
2013  77611.443142
2014  75463.918140

In [10]:
# Renomeia as colunas especificadas
df_salarios_medios_anuais.rename(columns={"Year": "Ano", "TotalPay": "Sal√°rio M√©dio"}, inplace=True)

# Aplica a fun√ß√£o de formatar moedas na coluna especificada
df_salarios_medios_anuais = df_salarios_medios_anuais["Sal√°rio M√©dio"].apply(formatar_moeda)

# Exibe o dataframe
df_salarios_medios_anuais

Year
2011    R$ 71.744,10
2012    R$ 74.113,26
2013    R$ 77.611,44
2014    R$ 75.463,92
Name: Sal√°rio M√©dio, dtype: object

__Quantidade de funcion√°rios ao longo dos anos:__

In [11]:
# Dataframe com a quantidade de funcion√°rios agrupados por ano
df_num_funcionarios_anual = df_salarios[["Year", "Id"]].groupby("Year").count()

# Exibe o dataframe
df_num_funcionarios_anual

         Id
Year
2011  36159
2012  36766
2013  37606
2014  38123

In [12]:
# Renomeia as colunas especificadas
df_num_funcionarios_anual.rename(columns={"Id": "Qtde Funcion√°rios"}, inplace=True)

# Aplica a formata√ß√£o de valor na coluna especificada
df_num_funcionarios_anual = df_num_funcionarios_anual["Qtde Funcion√°rios"].apply(formatar_valor)

# Exibe o dataframe
df_num_funcionarios_anual

Year
2011    36.159,00
2012    36.766,00
2013    37.606,00
2014    38.123,00
Name: Qtde Funcion√°rios, dtype: object

__Evolu√ß√£o da folha de pagamentos:__

In [13]:
# Dataframe com o total dos sal√°rios ano a ano
df_folha_pagamento_anual = df_salarios[["Year", "TotalPay"]].groupby("Year").sum()

# Exibi√ß√£o do dataframe
df_folha_pagamento_anual

          TotalPay
Year
2011  2.594195e+09
2012  2.724848e+09
2013  2.918656e+09
2014  2.876911e+09

In [14]:
df_folha_pagamento_anual.rename(columns={"TotalPay": "Total Sal√°rios"}, inplace=True)
df_folha_pagamento_anual = df_folha_pagamento_anual["Total Sal√°rios"].apply(formatar_moeda)
df_folha_pagamento_anual

Year
2011    R$ 2.594.195.051,88
2012    R$ 2.724.848.200,44
2013    R$ 2.918.655.930,80
2014    R$ 2.876.910.951,26
Name: Total Sal√°rios, dtype: object